---
kind: property
id: P:Autodesk.Revit.DB.Analysis.SpatialFieldManager.AllowInteractiveSettings
source: html/ac69e3e2-3555-204c-6abc-522b508df20c.htm
---
# Autodesk.Revit.DB.Analysis.SpatialFieldManager.AllowInteractiveSettings Property

If true interactive settings dialog and pick deletion are allowed.

## Syntax (C#)
```csharp
public bool AllowInteractiveSettings { get; set; }
```

## Remarks
Note that SpatialFieldManager cannot be deleted if this property is set to false.